<template>
  <div id="app">
    <the-scroller :list="list"></the-scroller>
  </div>
</template>

<script>
import TheScroller from "./components/TheScroller.vue";

export default {
  name: "App",
  components: {
    TheScroller,
  },
  data() {
    return {
      list: [
        "Базовые сценарии поведения пользователей освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, своевременно верифицированы. Также как социально-экономическое развитие способствует повышению качества системы массового участия.",
        "Принимая во внимание показатели успешности, высококачественный прототип будущего проекта в значительной степени обусловливает важность новых принципов формирования материально-технической и кадровой базы.",
        "Базовые сценарии поведения пользователей освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, своевременно верифицированы. Также как социально-экономическое развитие способствует повышению качества системы массового участия.",
        "Принимая во внимание показатели успешности, высококачественный прототип будущего проекта в значительной степени обусловливает важность новых принципов формирования материально-технической и кадровой базы.",
      ],
    };
  },
};
</script>

<style>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
}
</style>
